; domain
(define (domain robotwaiter)
  (:requirements :strips :typing :negative-preconditions)

    (:types dish location table)

    (:predicates
    (robot-at ?a - location)                           ; robot is at location ?a
    (adjacent ?a1 - location ?a2 - location)           ; locations ?a1 and ?a2 are adjacent
    (dish-at ?d - dish ?a - location)                  ; dish ?d is at location ?a
    (carrying ?d - dish)                               ; robot is carrying dish ?d
    (free-hands)                                       ; robot's hands are free
    (table-at ?t - table ?a - location)                ; table ?t is at location ?a
    (order-at ?d - dish ?t - table)                    ; dish ?d is ordered at table ?t
    (served ?d - dish ?t - table)                                ; table ?t has been served
    )

  ; MOVE: robot walks from one area to an adjacent area.
  (:action move
    :parameters (?from - location ?to - location)
    :precondition (and
      (robot-at ?from)                          ; robot at area
      (adjacent ?from ?to)                      ; destination its adjacent to "from"
    )
    :effect (and
      (NOT (robot-at ?from))                    ; from has no robot
      (robot-at ?to)                            ; robot at destination
    )
  )

  (:action pick-up
      :parameters (?d - dish ?a - location)
      :precondition (and 
                    (robot-at ?a)
                    (dish-at ?d ?a)
                    (free-hands)
                    )
      :effect (and 
              (carrying ?d)
              (NOT (free-hands))
              (NOT (dish-at ?d ?a))
              )
  )

  (:action present-dish
      :parameters (?d - dish ?a - location ?t - table)
      :precondition (and 
                    (robot-at ?a)
                    (carrying ?d)
                    (table-at ?t ?a)
                    (order-at ?d ?t)
                    (NOT (served ?d ?t))
                    )
      :effect (and 
              (served ?d ?t)
              (NOT (carrying ?d))
              (free-hands)
              )
    )
)

; problem
(define (problem restaurant-delivery-simple)
  (:domain robotwaiter)
  
  (:objects
    ; Locations
    kitchen hall dr1 dr2 dr3 dr4 dr5 - location
    
    ; Dishes
    macarrones - dish
    
    ; Tables
    table1 - table
  )
  
  (:init
    ; Correct adjacencies based on the map
    (adjacent kitchen dr1)
    
    (adjacent dr1 kitchen)
    (adjacent dr1 dr3)
    (adjacent dr1 dr2)

    (adjacent dr2 dr1)
    (adjacent dr2 hall)

    (adjacent dr3 dr1)
    (adjacent dr3 dr4)
        
    (adjacent dr4 dr3)
    (adjacent dr4 dr5)

    (adjacent dr5 dr4)
    (adjacent dr5 hall)

    (adjacent hall dr2)
    (adjacent hall dr5)
    
    ; Initial state
    (robot-at kitchen)
    (dish-at macarrones kitchen)
    (table-at table1 dr4)
    (free-hands)
    
    ; Order
    (order-at macarrones table1)
  )
  
  (:goal (and
    (served macarrones table1)
    (robot-at kitchen)
    )
  )
)

; plan
1. (pick-up macarrones kitchen)
   deleted: (free-hands) (dish-at macarrones kitchen)
   added: (carrying macarrones)
   goals met: 1 of 2
2. (move kitchen dr1)
   deleted: (robot-at kitchen)
   added: (robot-at dr1)
   goals met: 0 of 2
3. (move dr1 dr3)
   deleted: (robot-at dr1)
   added: (robot-at dr3)
   goals met: 0 of 2
4. (move dr3 dr4)
   deleted: (robot-at dr3)
   added: (robot-at dr4)
   goals met: 0 of 2
5. (present-dish macarrones dr4 table1)
   deleted: (carrying macarrones)
   added: (served macarrones table1) (free-hands)
   goals met: 1 of 2
6. (move dr4 dr3)
   deleted: (robot-at dr4)
   added: (robot-at dr3)
   goals met: 1 of 2
7. (move dr3 dr1)
   deleted: (robot-at dr3)
   added: (robot-at dr1)
   goals met: 1 of 2
8. (move dr1 kitchen)
   deleted: (robot-at dr1)
   added: (robot-at kitchen)
   goals met: 2 of 2
